Reports/лб_НачислениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>лб_НачислениеПени</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПениПоУслугамЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХПоПериоду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХПоПериоду</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидНачисленияПоУслугамЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/бит_ГрафыОтчетаПоГЦЖС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ГрафыОтчетаПоГЦЖС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Техобслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлатаЗаНайм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВывозБытовыхОтходов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отопление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Водопровод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Электроэнергия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Газ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГорячееВодоснобжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХолодноеВодоснабжение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчисткаСтоков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ХВСДляГВС</Name>
					<Comment>Холодная вода для подогрева и обеспечения горячего водоснабжения</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КапитальныйРемонт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ЛицевыеСчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемЕЛСГИСЖКХ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемИдентификаторЖКУ</Name>
					<Comment>ГИС ЖКХ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КапРемПрефикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоГУГЦЖС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВестиРасчетПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьПоГруппам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЛицевогоСчетаГИСЖКХ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипЛицевогоСчетаГИСЖКХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СписокУлиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Льготный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/лб_НачислениеПени/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура Сформировать(Команда)
	
	Таблица = СформироватьНаСервере();
	Таблица.Показать();
	
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере()

	СтавкаРефинансирования = 0;
	Организация = Справочники.Организации.НайтиПоНаименованию("УК ЛЕВОБЕРЕЖЬЕ ЗАО");
	Таблица = Новый ТабличныйДокумент;
	СписокЛС    = Новый Массив;
	Если ЗначениеЗаполнено (ЛицевойСчет) Тогда
		СписокЛС = ЛицевойСчет;
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Здание КАК Здание,
		|	бит_ЛицевыеСчета.Квартира КАК Квартира
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка"        , ЛицевойСчет);	
		Адрес = Запрос.Выполнить().Выгрузить();
		//Иначе 
		//	 Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//		"ВЫБРАТЬ
		//		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		//		|ИЗ
		//		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета";
		//	//Запрос.УстановитьПараметр("ВидНоменклатуры",Справочники.ВидыНоменклатуры.НайтиПоНаименованию("Полуфабрикаты"));
		//	Результат = Запрос.Выполнить().Выгрузить();
		//	СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей КАК ПоследнийДеньПриемаПлатежей
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних КАК бит_НастройкаПараметровЖКХСрезПоследних
	|ГДЕ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация = &Организация";
	
	СрокОплаты = Запрос.Выполнить().Выгрузить();
	СрокОплаты = СрокОплаты[0].ПоследнийДеньПриемаПлатежей;
	
	Макет = Новый ТабличныйДокумент;
	Макет =Отчеты.лб_НачислениеПени.ПолучитьМакет("Макет");

	//ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	//Макет = ОтчетОбъект.ПолучитьМакет("Макет"); 
	Шапка = Макет.ПолучитьОбласть("ОбластьШапка");
	Шапка.Параметры.НачалоПериода = Формат(Период.ДатаНачала,"ДЛФ=DD");
	Шапка.Параметры.КонецПериода = Формат(Период.ДатаОкончания,"ДЛФ=DD");
	Шапка.Параметры.ЛицевойСчет = "Лицевой счет " + ЛицевойСчет;
	Шапка.Параметры.АдресПроживания = "Адрес проживания: " + Адрес[0].Здание + ", кв." + Адрес[0].Квартира;
	ИтогоСумма = 0;
	Таблица.Вывести(Шапка);
	
	
	СсылкаОС = Неопределено;
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("НачислятьПени"                , Ложь);
	СтруктураПараметров.Вставить("НачислятьПениСУчетомПереплаты", Ложь);
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(Период.ДатаОкончания, Организация, СтруктураПараметров);
	
	//ЛицевыеСчета.Очистить();
	
	Если НЕ СтруктураПараметров.НачислятьПени Тогда
		
		ШаблоСообщения = НСтр("ru='В настройках %1 от %2 начисление пени отключено.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		ШаблоСообщения, Организация, Формат(Период.ДатаОкончания, "ДФ=dd.MM.yyyy")));
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей >= ДЕНЬ(&Дата)
	|			ТОГДА НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1 - бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|		ИНАЧЕ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени), МЕСЯЦ)
	|	КОНЕЦ КАК Момент,
	|	ВЫБОР
	|		КОГДА ВЫБОР
	|				КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|					ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|				ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|			КОНЕЦ >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ)
	|			ТОГДА РАЗНОСТЬДАТ(ВЫБОР
	|						КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ))
	|							ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
	|						ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|					КОНЕЦ, КОНЕЦПЕРИОДА(ВЫБОР
	|							КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ))
	|								ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ)
	|							ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -1), МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|						КОНЕЦ, МЕСЯЦ), ДЕНЬ) + ДЕНЬ(&Дата)
	|		ИНАЧЕ РАЗНОСТЬДАТ(ВЫБОР
	|					КОГДА бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей > ДЕНЬ(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ))
	|						ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ), ДЕНЬ, бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей - 1)
	|				КОНЕЦ, &Дата, ДЕНЬ)
	|	КОНЕЦ КАК КоличествоДней
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"        , Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Организация" , Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Момент			= Выборка.Момент;
		КоличествоДней	= Выборка.КоличествоДней;
	Иначе
		ТекстСообщения = НСтр("ru = 'Настройте параметры ЖКХ для организации.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.Наименование КАК Наименование
	|ПОМЕСТИТЬ ТаблицаЛС
	|ИЗ
	|	РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(
	|			&Дата,
	|			ЛицевойСчет В (&СписокЛС)
	|				И НЕ ЛицевойСчет.ПометкаУдаления
	|				И НЕ ЛицевойСчет.Архивный) КАК бит_СведенияПоУслугамЛССрезПоследних
	|ГДЕ
	|	НЕ бит_СведенияПоУслугамЛССрезПоследних.ЛицевойСчет.НеВестиРасчетПени
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней + 1), ДЕНЬ) КАК Период,
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления.КоличествоМесяцев, 999) КАК КоличествоМесяцев,
	|	бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления КАК ПериодНачисленияПени,
	|	бит_ПениПоУслугамЖКХСрезПоследних.Услуга КАК Услуга,
	|	ВЫБОР
	|		КОГДА бит_ПениПоУслугамЖКХСрезПоследних.Начислять
	|			ТОГДА бит_ПениПоУслугамЖКХСрезПоследних.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Процент
	|ПОМЕСТИТЬ ВсеПроценты
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней), Организация = &Организация) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(бит_ПениПоУслугамЖКХ.Период, ДЕНЬ),
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХ.ПериодНачисления.КоличествоМесяцев, 999),
	|	бит_ПениПоУслугамЖКХ.ПериодНачисления,
	|	бит_ПениПоУслугамЖКХ.Услуга,
	|	ВЫБОР
	|		КОГДА бит_ПениПоУслугамЖКХ.Начислять
	|			ТОГДА бит_ПениПоУслугамЖКХ.Процент
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ КАК бит_ПениПоУслугамЖКХ
	|ГДЕ
	|	бит_ПениПоУслугамЖКХ.Период МЕЖДУ ДОБАВИТЬКДАТЕ(&Дата, ДЕНЬ, -&КоличествоДней) И &Дата
	|	И бит_ПениПоУслугамЖКХ.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВсеПроценты.Период) КАК Период,
	|	ВсеПроценты.КоличествоМесяцев,
	|	ВсеПроценты.ПериодНачисленияПени,
	|	ВсеПроценты.Услуга КАК Услуга,
	|	ВсеПроценты.Процент КАК Процент
	|ПОМЕСТИТЬ ИтоговаяПроценты
	|ИЗ
	|	ВсеПроценты КАК ВсеПроценты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеПроценты.КоличествоМесяцев,
	|	ВсеПроценты.ПериодНачисленияПени,
	|	ВсеПроценты.Услуга,
	|	ВсеПроценты.Процент
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Период,
	|	Услуга,
	|	ВсеПроценты.КоличествоМесяцев
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВсеПроценты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяПроценты.КоличествоМесяцев,
	|	ИтоговаяПроценты.ПериодНачисленияПени,
	|	ИтоговаяПроценты.Услуга КАК Услуга,
	|	ИтоговаяПроценты.Период КАК Период,
	|	ИтоговаяПроценты.Процент КАК Процент,
	|	ЕСТЬNULL(МИНИМУМ(РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, ИтоговаяПроцентыРазность.Период, ДЕНЬ)), РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, &Дата, ДЕНЬ) + 1) КАК КоличествоДней
	|ПОМЕСТИТЬ ИтоговаТаблица
	|ИЗ
	|	ИтоговаяПроценты КАК ИтоговаяПроценты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИтоговаяПроценты КАК ИтоговаяПроцентыРазность
	|		ПО ИтоговаяПроценты.Услуга = ИтоговаяПроцентыРазность.Услуга
	|			И ИтоговаяПроценты.КоличествоМесяцев = ИтоговаяПроцентыРазность.КоличествоМесяцев
	|			И ИтоговаяПроценты.Период < ИтоговаяПроцентыРазность.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ИтоговаяПроценты.Период,
	|	ИтоговаяПроценты.КоличествоМесяцев,
	|	ИтоговаяПроценты.ПериодНачисленияПени,
	|	ИтоговаяПроценты.Услуга,
	|	ИтоговаяПроценты.Процент
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(МИНИМУМ(РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, ИтоговаяПроцентыРазность.Период, ДЕНЬ)), РАЗНОСТЬДАТ(ИтоговаяПроценты.Период, &Дата, ДЕНЬ) + 1) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Услуга
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЛС.ЛицевойСчет КАК ЛС,
	|	ИтоговаТаблица.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ИтоговаТаблица.ПериодНачисленияПени КАК ПериодНачисленияПени,
	|	ИтоговаТаблица.Услуга КАК Услуга,
	|	ЕСТЬNULL(ИтоговаТаблица.Процент, 0) КАК ПроцентПени,
	|	ИтоговаТаблица.КоличествоДней КАК КоличествоДней,
	|	ТаблицаЛС.Наименование КАК Наименование,
	|	ИтоговаТаблица.Услуга.Приоритет КАК Приоритет
	|ИЗ
	|	ТаблицаЛС КАК ТаблицаЛС
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ИтоговаТаблица КАК ИтоговаТаблица
	|		ПО ТаблицаЛС.Услуга = ИтоговаТаблица.Услуга
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоМесяцев УБЫВ,
	|	Наименование,
	|	Приоритет
	|ИТОГИ ПО
	|	ЛС,
	|	КоличествоМесяцев";
	
	Запрос.УстановитьПараметр("Дата"        	, Момент);
	Запрос.УстановитьПараметр("Организация"		, Организация);
	Запрос.УстановитьПараметр("КоличествоДней"	, КоличествоДней);
	Запрос.УстановитьПараметр("СписокЛС"    , СписокЛС);
	
	ТаблицаЛС1 = Запрос.Выполнить().Выгрузить();
	ВыборкаЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ТаблицаЛС1.Свернуть("ЛС");
	ТаблицаДолгаЛС = ПолучитьТаблицуДолга(СсылкаОС, Момент, ТаблицаЛС1,Организация);
	//ТаблицаЛС = ДокПени.ЛицевыеСчета.ВыгрузитьКолонки();
	Если ТаблицаДолгаЛС = Неопределено Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если СсылкаОС <> Неопределено Тогда
		ТабОстатокСуммы = СсылкаОС.СписокУслуг.Выгрузить(,"ЛицевойСчет, Услуга, Сумма");
		ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
	КонецЕсли;
	
	Пени  = Справочники.бит_УслугиЖКХ.Пени;
	ПениПоКапРемонт  = Справочники.бит_УслугиЖКХ.ПениПоКапитальномуРемонту ;
	КалендарныхДней = День(КонецМесяца(Период.ДатаОкончания));
	
	ИспЛС = Новый ТаблицаЗначений;
	ИспЛС.Колонки.Добавить("ЛС",,"ЛС");
	ИспЛС.Колонки.Добавить("Услуга",,"Услуга");
	ИспЛС.Колонки.Добавить("ПериодМес",,"ПериодМес");
	
	// Обход лицевых счетов.
	Пока ВыборкаЛС.Следующий() Цикл
		
		кэшЛицевойСчет = ВыборкаЛС.ЛС;
		
		// Переплат.
		Отбор = Новый Структура("ЛицевойСчет", ВыборкаЛС.ЛС);
		ТаблицаПереплат = ТаблицаДолгаЛС.Скопировать(Отбор);
		Если ТаблицаПереплат.Количество() = 0 Тогда
			Продолжить; //Нет данных о долге по ЛС.
		КонецЕсли; 
		ТаблицаПереплат.Свернуть("Услуга, Переплата");
		ПереплатаИтог = ТаблицаПереплат.Итог("Переплата");
		
		//Обход Количества месяцев задолженсти.
		ВыборкаКоличествоМесяцев = ВыборкаЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаКоличествоМесяцев.Следующий() Цикл
			
			Отбор = Новый Структура("ЛицевойСчет, КоличествоМесяцев", ВыборкаКоличествоМесяцев.ЛС, ВыборкаКоличествоМесяцев.КоличествоМесяцев);
			ТаблицаДолга = ТаблицаДолгаЛС.Скопировать(Отбор);
			
			Если ТаблицаДолга.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли; 
			
			ДолгИтог = ТаблицаДолга.Итог("ДолгДляНачисления");
			Остаток = ДолгИтог - ПереплатаИтог;
			
			Если Остаток < 0 И СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
				ПереплатаИтог = ПереплатаИтог - ДолгИтог;
				Продолжить;
			ИначеЕсли Остаток > 0 И СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
				ПереплатаИтог = 0;
			КонецЕсли; 
			
			// Обход Услуг.
			кэшУслуга = Неопределено;
			
			ВыборкаУслуг = ВыборкаКоличествоМесяцев.Выбрать();
			Пока ВыборкаУслуг.Следующий() Цикл
				
				Если ВыборкаУслуг.Услуга = Пени Или ВыборкаУслуг.Услуга = ПениПоКапРемонт Тогда
					Продолжить;
				КонецЕсли;
				
				Отбор = Новый Структура;
				Отбор.Вставить("ЛицевойСчет", ВыборкаУслуг.ЛС);
				Отбор.Вставить("Услуга"     , ВыборкаУслуг.Услуга);
				
				СтрокаДолга = ТаблицаДолга.НайтиСтроки(Отбор);
				
				Таб1 = ТаблицаДолга.Скопировать();
				Таб1.Очистить();
				Для каждого Стр Из СтрокаДолга Цикл
					НовСтр = Таб1.Добавить();
					ЗаполнитьЗначенияСвойств(НовСтр, Стр);
				КонецЦикла;
				
				Таб2 = Таб1.Скопировать();
				Таб2.Свернуть("ПериодВзаиморасчетов");
				Таб3 = ТаблицаДолга.Скопировать();
				Таб3.Очистить();
				
				ЕстьОплата = Ложь;
				
				Для каждого СтрТаб2 Из Таб2 Цикл
					ЕстьОплата = Ложь;
					Отбор = Новый Структура("ПериодВзаиморасчетов", СтрТаб2.ПериодВзаиморасчетов);
					НайденныеСтроки = Таб1.НайтиСтроки(Отбор);
					Если Не НайденныеСтроки.Количество() = 0 Тогда
						
						Если НайденныеСтроки.Количество() > 1 Тогда
							
							ЗначениеМаксимальногоЭлемента = 0;
							ЗначениеМинимальногоЭлемента = 10000000;
							Попытка
								
								
								Для Индекс = 0 По НайденныеСтроки.Количество() - 1 Цикл
									
									Если НачалоДня(НайденныеСтроки[Индекс].Период1) = НачалоДня(НайденныеСтроки[Индекс].ПериодВзаиморасчетов) Тогда
										
										Если (НайденныеСтроки[Индекс].СуммаОстаток1 > ЗначениеМаксимальногоЭлемента) Тогда
											ЗначениеМаксимальногоЭлемента = НайденныеСтроки[Индекс].СуммаОстаток1;
											ИндексМаксимальногоЭлемента = Индекс;
										КонецЕсли;
										
									Иначе 
										
										Если (НайденныеСтроки[Индекс].СуммаОстаток1 < ЗначениеМинимальногоЭлемента)  Тогда
											ЗначениеМинимальногоЭлемента = НайденныеСтроки[Индекс].СуммаОстаток1;
											ИндексМинимальногоЭлемента = Индекс;
											ЕстьОплата = Истина;
										КонецЕсли;
										
									КонецЕсли; 
									
								КонецЦикла;
								
								НовСтр = Таб3.Добавить();
								ЗаполнитьЗначенияСвойств(НовСтр, НайденныеСтроки[ИндексМаксимальногоЭлемента]);
								
								Если ЕстьОплата = Истина Тогда
									
									НовСтр = Таб3.Добавить();
									ЗаполнитьЗначенияСвойств(НовСтр, НайденныеСтроки[ИндексМинимальногоЭлемента]);
									
								КонецЕсли;   								
							Исключение
								продолжить;
							КонецПопытки;
							
						КонецЕсли; 
						
					КонецЕсли; 
					
				КонецЦикла; 
				
				ОтборЛС = Новый Структура("ЛС, Услуга", ВыборкаУслуг.ЛС, ВыборкаУслуг.Услуга);
				
				Строка = ИспЛС.НайтиСтроки(ОтборЛС);
				Если Строка.Количество() <> 0 Тогда
					Продолжить;
				КонецЕсли;
				
				Попытка
					
					Если Таб3.Количество() > 1 Тогда
						
						СтрокаДолга.Очистить();
						СтрокаДолга =  Таб3.Скопировать();
						
					КонецЕсли; 
					
					Долг = СтрокаДолга[0].ДолгДляНачисления;
					Если СтрокаДолга[0].Период = 0 Тогда
						КоличествоДнейИтог = КоличествоДней;	
					Иначе	
						КоличествоДнейИтог = (СтрокаДолга[0].Период);
					КонецЕсли; 
					
					//ПериодДолга = (Формат((НачалоМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), "ДЛФ=Д"));
					
					й = Дата(Год(НачалоМесяца(СтрокаДолга[0].Период1)), Месяц(НачалоМесяца(СтрокаДолга[0].Период1)), День(НачалоМесяца(СтрокаДолга[0].Период1))) ;
					МассивДолг = Новый Массив;	
					МассивДолгСумма = Новый Массив;	
					
					МассивДней = Новый Массив;
					Для Индекс = 0 По СтрокаДолга.Количество() - 1 цикл	
						Если СтрокаДолга[Индекс].ДолгДляНачисления < 0 Тогда
							СтрокаДолга[Индекс].ДолгДляНачисления = 0;
							СтрокаДолга[Индекс].Долг = 0;
							//ПустойПериод =  СтрокаДолга[Индекс].ПериодВзаиморасчетов;
							//СтрокаДолга.Удалить(Индекс);
						КонецЕсли; 
					КонецЦикла;
					//
					//Если ЗначениеЗаполнено(ПустойПериод) Тогда
					//	 Для Индекс = 0 По СтрокаДолга.Количество() - 1 Цикл
					//	 	Если СтрокаДолга[Индекс].ПериодВзаиморасчетов = ПустойПериод Тогда
					//			СтрокаДолга[Индекс].ДолгДляНачисления = 0;
					//			СтрокаДолга[Индекс].Долг = 0;
					//		КонецЕсли; 	
					//	КонецЦикла;
					//КонецЕсли; 
					
					Для Индекс = 1  По СтрокаДолга.Количество() - 1 Цикл
						
						Если Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1))
							<> Дата(Год(КонецМесяца(СтрокаДолга[Индекс].Период1)), Месяц(КонецМесяца(СтрокаДолга[Индекс].Период1)), День(КонецМесяца(СтрокаДолга[Индекс].Период1))) Тогда
							Если й <> Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1)) Тогда
								й = Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1));	
								МассивДолг.Вставить(0);
								МассивДолг[0] = (Дата(Год(СтрокаДолга[Индекс].Период1), Месяц(СтрокаДолга[Индекс].Период1), День(СтрокаДолга[Индекс].Период1))) ;  
								МассивДолг.Вставить(0);
								МассивДолг[0] = (Дата(Год(СтрокаДолга[Индекс-1].Период1), Месяц(СтрокаДолга[Индекс-1].Период1), День(СтрокаДолга[Индекс-1].Период1))) ;
								МассивДолгСумма.Добавить(СтрокаДолга[Индекс].СуммаОстаток1 );  
							КонецЕсли; 
							
						КонецЕсли;
						
					КонецЦикла;
					
					
					//РазницаВДнях = (НачалоДня(ДатаОкончания) - НачалоДня(ДатаНачала)) / (60 * 60 * 24);
					//Если Не МассивДолг.Количество() = 0 Тогда				 
					//	ИндексПоследнего = МассивДолг.ВГраница();
					//	й = Дата(Год(КонецМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), Месяц(КонецМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), День(КонецМесяца(СтрокаДолга[0].ПериодВзаиморасчетов))); 	
					//	Для Индекс = -ИндексПоследнего По 0 Цикл
					//		//Значение = МассивДолг[-Индекс];
					//		МассивДней.Вставить(0);
					//		МассивДней[0] = ((НачалоДня(й) - НачалоДня(МассивДолг[-Индекс]))/(60 * 60 * 24) );
					//		//МассивДней.Вставить(0);
					//		й = Дата(Год((МассивДолг[-Индекс])), Месяц((МассивДолг[-Индекс])), День((МассивДолг[-Индекс])));
					//	КонецЦикла;
					//	Если МассивДней.Количество() >= 2 Тогда
					//		МассивДней.Вставить(МассивДолг.Количество() - 1, ( (НачалоДня(й) - НачалоДня((Дата(Год(НачалоМесяца(МассивДолг[0])), Месяц(НачалоМесяца(МассивДолг[0])), День(НачалоМесяца(МассивДолг[0])))))) /(60 * 60 * 24)  + 1));
					//	Иначе 			
					//		ц =  (НачалоДня(й) - НачалоДня((Дата(Год(НачалоМесяца(МассивДолг[0])), Месяц(НачалоМесяца(МассивДолг[0])), День(НачалоМесяца(МассивДолг[0])))))) /(60 * 60 * 24)  + 1;	
					//		МассивДней.Вставить(0);
					//		МассивДней[0] = ц;
					//	КонецЕсли;
					//КонецЕсли;
					//ц =  (НачалоДня(й) - НачалоДня((Дата(Год(НачалоМесяца(МассивДолг[0])), Месяц(НачалоМесяца(МассивДолг[0])), День(НачалоМесяца(МассивДолг[0])))))) /(60 * 60 * 24)  + 1;	
					//МассивДней.Вставить(0);
					//МассивДней[0] = ц;
					//КонецЕсли;	
					//
					//Если Не МассивДолг.Количество() = 0 Тогда				 
					//ИндексПоследнего = МассивДолг.ВГраница();
					//й = Дата(Год(КонецМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), Месяц(КонецМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), День(КонецМесяца(СтрокаДолга[0].ПериодВзаиморасчетов))); 	
					//	Для Индекс = 0 По МассивДолг.Количество() - 1 Цикл
					//		//Значение = МассивДолг[-Индекс];
					//		МассивДней.Вставить(0);
					//		МассивДней[0] = ( ((НачалоДня(й) - НачалоДня(МассивДолг[Индекс]))/(60 * 60 * 24) ));
					//		//МассивДней.Вставить(0);
					//		й = Дата(Год((МассивДолг[Индекс])), Месяц((МассивДолг[Индекс])), День((МассивДолг[Индекс])));
					//	КонецЦикла;
					//Если МассивДней.Количество() >= 2 Тогда
					//	 МассивДней.Вставить(МассивДолг.Количество() - 2, ( (НачалоДня(й) - НачалоДня((Дата(Год(НачалоМесяца(МассивДолг[0])), Месяц(НачалоМесяца(МассивДолг[0])), День(НачалоМесяца(МассивДолг[0])))))) /(60 * 60 * 24)  + 1));
					//Иначе 			
					//	ц =  (НачалоДня(й) - НачалоДня((Дата(Год(НачалоМесяца(МассивДолг[0])), Месяц(НачалоМесяца(МассивДолг[0])), День(НачалоМесяца(МассивДолг[0])))))) /(60 * 60 * 24)  + 1;	
					//	МассивДней.Вставить(0);
					//	МассивДней[0] = ц;
					//КонецЕсли;
					//КонецЕсли;	
					
					Список = Новый СписокЗначений; 
					Список.ЗагрузитьЗначения(МассивДолгСумма);
					Список.СортироватьПоЗначению(НаправлениеСортировки.Убыв); 
					МассивДолгСумма = Список.ВыгрузитьЗначения();
					
				Исключение
					Продолжить;
				КонецПопытки;
				
				Попытка
					
					Если Долг < 0 Тогда
						Продолжить;
					КонецЕсли; 
					
					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						СсылкаОСОплатаУслуги = 0;
						Если СсылкаОС <> Неопределено Тогда
							Для каждого Строка Из ТабОстатокСуммы Цикл
								Если Строка.ЛицевойСчет = ВыборкаУслуг.ЛС и Строка.Услуга = ВыборкаУслуг.Услуга	Тогда
									СсылкаОСОплатаУслуги = Строка.Сумма;
									Прервать;
								КонецЕсли;
							КонецЦикла;
							
							Если СсылкаОСОплатаУслуги = 0 Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
				Исключение
					
					Продолжить;
					
				КонецПопытки;
				
				
				Если СтруктураПараметров.НачислятьПениСУчетомПереплаты Тогда
					
					//Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
					Если Остаток = 0 Тогда
						Прервать;
					КонецЕсли; 
					тмпСумма = Мин(Долг, Остаток);
					//КонецЕсли;
					
					Если СсылкаОС <> Неопределено Тогда
						// Ограничение долга остаткими по оплате.
						Если тмпСумма > СсылкаОСОплатаУслуги Тогда
							тмпСумма           = СсылкаОСОплатаУслуги;
						КонецЕсли;
						
						// Списываем с суммы оплаты уже начисленный долг.
						Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
							НСтрОстатокСуммы			 = ТабОстатокСуммы.Добавить();
							НСтрОстатокСуммы.ЛицевойСчет = ВыборкаУслуг.ЛС;
							НСтрОстатокСуммы.Услуга		 = ВыборкаУслуг.Услуга;
							НСтрОстатокСуммы.Сумма		 = -тмпСумма;
							ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
						КонецЕсли;
					КонецЕсли;
					
				
					
					//Без мин.взноса
					Стр = ИспЛС.Добавить();
					Стр.ЛС =  ВыборкаУслуг.ЛС;
					Стр.Услуга =  ВыборкаУслуг.Услуга;
					Стр.ПериодМес = ВыборкаУслуг.ПериодНачисленияПени;
					
					Если СтавкаРефинансирования = 0 Тогда
						 СтавкаРефинансирования = Окр(ВыборкаУслуг.ПроцентПени * 130,1)
					КонецЕсли; 
					
					ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
					
					//Первая строка, общий долг за период
					
					ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
					ОбластьСтрока.Параметры.СуммаЗадолженности			  = тмпСумма;
					ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
					ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
					ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
					ОбластьСтрока.Параметры.Сумма			  = Окр(тмпСумма * КалендарныхДней * (ВыборкаУслуг.ПроцентПени/100),2);	
					ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[0].ПериодВзаиморасчетов)), "ДЛФ=Д"));
					//ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					
					Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					
					Если Коэффициент = 0.0283 Тогда
						ОбластьСтрока.Параметры.Коэффициент		  = "1/130" ;
						//СтавкаРефинансирования = Окр(Коэффициент * 130,1);
						
					Иначе ОбластьСтрока.Параметры.Коэффициент		  = "1/300" ;
						//СтавкаРефинансирования = Окр(Коэффициент * 300,1);
						
					КонецЕсли; 
					
					
					ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
					//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
					Таблица.Вывести(ОбластьСтрока);
					
					//Следующий долг по периодам 	
					
					Попытка
						
						Для Индекс = 0 По СтрокаДолга.Количество() - 1  Цикл
							
							//КоличествоДнейПросрочки = Окр(НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24)) / 86400);
							
							Если СтрокаДолга[индекс].период >= 90 Тогда
								
								ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
								ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
								ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
								ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаНачала + ((СрокОплаты - 2)*(60 * 60 * 24)), "ДЛФ=Д"));
								Нач = Период.ДатаНачала;
								Кон = Период.ДатаНачала + ((СрокОплаты - 2)*(60 * 60 * 24));
								ОбластьСтрока.Параметры.Дней = (НачалоДня(Кон) - НачалоДня(нач)) / 86400+1;
								Дней = (НачалоДня(Кон) - НачалоДня(нач)) / 86400+1;
								ОбластьСтрока.Параметры.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * ( (НачалоДня(Кон) - НачалоДня(нач)) / 86400 + 1) * (0.0283)/100,2);
								й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
								ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
								ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
								
								//ОбластьСтрока.Параметры.Коэффициент		  = 0.0283;
								Коэффициент		  = 0.0283;
								
								Если Коэффициент = 0.0283 Тогда
									ОбластьСтрока.Параметры.Коэффициент		  = "1/130" ;
									//СтавкаРефинансирования = Окр(Коэффициент * 130,1);
									
								Иначе ОбластьСтрока.Параметры.Коэффициент		  = "1/300" ;
									//СтавкаРефинансирования = Окр(Коэффициент * 300,1);
									
								КонецЕсли; 
								ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
								
								
								//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
								ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
								ДолгБольше90 = Истина;
								Таблица.Вывести(ОбластьСтрока);	
								
							КонецЕсли; 
							
							Если ДолгБольше90 = Истина Тогда
								
								ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
								ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
								ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала + ((СрокОплаты - 1)*(60 * 60 * 24)), "ДЛФ=Д"));
								ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
								Нач = Период.ДатаНачала + ((СрокОплаты - 1)*(60 * 60 * 24));
								Кон =Период.ДатаОкончания;
								ОбластьСтрока.Параметры.Дней = (НачалоДня(Кон) - НачалоДня(нач)) / 86400+1;
								//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
								ОбластьСтрока.Параметры.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * ((НачалоДня(Кон) - НачалоДня(нач)) / 86400) * (ВыборкаУслуг.ПроцентПени/100),2);
								й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
								ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
								ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
								Коэффициент		  = ВыборкаУслуг.ПроцентПени;
								//ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
								//ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
								//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
								
								Если Коэффициент = 0.0283 Тогда
									ОбластьСтрока.Параметры.Коэффициент		  = "1/130" ;
									//СтавкаРефинансирования = Окр(Коэффициент * 130,1);
									
								Иначе ОбластьСтрока.Параметры.Коэффициент		  = "1/300" ;
									//СтавкаРефинансирования = Окр(Коэффициент * 300,1);
									
								КонецЕсли; 
								ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
								
								
								ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
								Таблица.Вывести(ОбластьСтрока);	
								ДолгБольше90 = Ложь;
								
							Иначе
								//Исправить процент пени
								Если СтрокаДолга[Индекс].период <= 91  Тогда
									Коэффициент = 0.0283;   
								Иначе 
									Коэффициент = ВыборкаУслуг.ПроцентПени;   
								КонецЕсли;
								
								
								Если (НЕ МассивДолг.Количество() = 0) И (НачалоДня(МассивДолг[0]) = НачалоДня(СтрокаДолга[Индекс].период1)) Тогда
									
									ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
									ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
									ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
									ОбластьСтрока.Параметры.РасчетПениКон = (Формат(МассивДолг[1] - 1,"ДЛФ=Д"));
									й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
									ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
									КоличествоДнейПросрочки = (й / 86400);
									Дней = ((НачалоДня(МассивДолг[1]) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24) ); 
									//Если КоличествоДнейПросрочки < Дней Тогда
									//	Дней = КоличествоДнейПросрочки   	
									//Иначе 
									//	Дней = КалендарныхДней;	
									//КонецЕсли;
									ОбластьСтрока.Параметры.Дней = Дней ;
									ОбластьСтрока.Параметры.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
									ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.Коэффициент		  = Коэффициент;
									
									Если Коэффициент = 0.0283 Тогда
										ОбластьСтрока.Параметры.Коэффициент		  = "1/130" ;
										//СтавкаРефинансирования = Окр(Коэффициент * 130,1);
										
									Иначе ОбластьСтрока.Параметры.Коэффициент		  = "1/300" ;
										//СтавкаРефинансирования = Окр(Коэффициент * 300,1);
										
									КонецЕсли; 
									
									ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
									
									
									//ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;						
									
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
									ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
									Таблица.Вывести(ОбластьСтрока);	
									
								ИначеЕсли (НЕ МассивДолг.Количество() = 0) И Месяц(СтрокаДолга[Индекс].ПериодВзаиморасчетов) =  Месяц(МассивДолг[0])  Тогда 	
									
									ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
									ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
									ОбластьСтрока.Параметры.РасчетПениНач = (Формат(МассивДолг[1],"ДЛФ=Д"));
									ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания,"ДЛФ=Д"));
									й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
									ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400); 
									й = (НачалоДня((КонецМесяца(Период.ДатаОкончания)))) - (НачалоДня(МассивДолг[1]));
									Дней = (й /(60 * 60 * 24)+1); 
									//Если КоличествоДнейПросрочки < Дней Тогда
									//	Дней = КоличествоДнейПросрочки   	
									//Иначе 
									//	Дней = КалендарныхДней;	
									//КонецЕсли;
									ОбластьСтрока.Параметры.Дней = Дней ;
									ОбластьСтрока.Параметры.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
									ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
									//ОбластьСтрока.Параметры.Коэффициент		  = Коэффициент;
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
									//ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
									
									Если Коэффициент = 0.0283 Тогда
										ОбластьСтрока.Параметры.Коэффициент		  = "1/130" ;
									Иначе ОбластьСтрока.Параметры.Коэффициент		  = "1/300" ;
									КонецЕсли; 
									
									
									ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
									Таблица.Вывести(ОбластьСтрока);	
									
									
								Иначе 
									
									ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
									ОбластьСтрока.Параметры.СуммаЗадолженности			  = СтрокаДолга[Индекс].СуммаОстаток1;
									ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
									ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
									й = НачалоДня((НачалоМесяца(Период.ДатаНачала))) - НачалоДня(((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов))) + (СрокОплаты-1) * (60 * 60 * 24));
									ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = (й / 86400);
									КоличествоДнейПросрочки = (й / 86400);
									Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 ); 
									
									Если КоличествоДнейПросрочки < Дней Тогда
										Дней = КоличествоДнейПросрочки   	
									Иначе 
										Дней = КалендарныхДней;	
									КонецЕсли; 
									
									ОбластьСтрока.Параметры.Дней = Дней ;
									ОбластьСтрока.Параметры.Сумма			  = Окр(СтрокаДолга[Индекс].СуммаОстаток1 * Дней * (Коэффициент/100),2);
									//ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
									ОбластьСтрока.Параметры.ПериодНачисленияПени = (Формат((НачалоМесяца(СтрокаДолга[Индекс].ПериодВзаиморасчетов)) + (СрокОплаты-1) * (60 * 60 * 24), "ДЛФ=Д"));
									ОбластьСтрока.Параметры.Коэффициент		  = Коэффициент;
									//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
									//ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
									
									Если Коэффициент = 0.0283 Тогда
										ОбластьСтрока.Параметры.Коэффициент		  = "1/130" ;
										//СтавкаРефинансирования = Окр(Коэффициент * 130,1);
										
									Иначе ОбластьСтрока.Параметры.Коэффициент		  = "1/300" ;
										//СтавкаРефинансирования = Окр(Коэффициент * 300,1);
										
									КонецЕсли; 
									ОбластьСтрока.Параметры.СтавкаРефинансирования = СтавкаРефинансирования;
									
									
									
									ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
									Таблица.Вывести(ОбластьСтрока);	
									
									
								КонецЕсли; 
								
							КонецЕсли; 
						КонецЦикла;
						
						//С мин.взносом	
						//Стр = ИспЛС.Добавить();
						//Стр.ЛС =  ВыборкаУслуг.ЛС;
						//Стр.Услуга =  ВыборкаУслуг.Услуга;
						//Стр.ПериодМес = ВыборкаУслуг.ПериодНачисленияПени;
						
					Исключение
						Продолжить;
					КонецПопытки; 	
					
					//Если НЕ МассивДолг.Количество() = 0 И ЗначениеЗаполнено(ВыборкаУслуг.ПроцентПени) Тогда
					//	й = НачалоДня(НачалоМесяца(СтрокаДолга[0].ПериодВзаиморасчетов));
					//	
					//	Для Индекс = 0 По МассивДолг.Количество() - 1  Цикл
					//		//ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
					//		
					//		ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
					//		ОбластьСтрока.Параметры.СуммаЗадолженности = МассивДолгСумма[Индекс];
					//		ОбластьСтрока.Параметры.ПериодНачисленияПени =  ПериодДолга;
					//		ОбластьСтрока.Параметры.РасчетПениНач = (Формат(й, "ДЛФ=Д"));
					//		РасчетПениНач = й;
					//		й =  МассивДолг[Индекс];
					//		ОбластьСтрока.Параметры.РасчетПениКон = (Формат(й - 1, "ДЛФ=Д"));
					//		ОбластьСтрока.Параметры.Дней = ((НачалоДня((й)) - НачалоДня(РасчетПениНач))/(60 * 60 * 24));
					//		ОбластьСтрока.Параметры.Сумма =  Окр(МассивДолгСумма[Индекс] *((НачалоДня((й)) - НачалоДня(РасчетПениНач))/(60 * 60 * 24)) * (ВыборкаУслуг.ПроцентПени/100),2); 
					//		ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					//		ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					//		Таблица.Вывести(ОбластьСтрока);	
					//		
					//	КонецЦикла;  					
					//	
					//	ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
					//	ОбластьСтрока.Параметры.СуммаЗадолженности = тмпСумма;
					//	ОбластьСтрока.Параметры.ПериодНачисленияПени =  ПериодДолга;
					//	ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					//	ОбластьСтрока.Параметры.РасчетПениНач = (Формат(й, "ДЛФ=Д"));
					//	ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
					//	ОбластьСтрока.Параметры.Дней = ((НачалоДня(Период.ДатаОкончания)  - НачалоДня(й))/(60 * 60 * 24) + 1) ;
					//	ОбластьСтрока.Параметры.Сумма			  = Окр(тмпСумма *((НачалоДня(Период.ДатаОкончания)  - НачалоДня(й))/(60 * 60 * 24) + 1) * (ВыборкаУслуг.ПроцентПени/100),2) ;	
					//	ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					//	Таблица.Вывести(ОбластьСтрока);	
					//	
					//ИначеЕсли ЗначениеЗаполнено(ВыборкаУслуг.ПроцентПени) Тогда 						
					//	ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
					//	ОбластьСтрока.Параметры.СуммаЗадолженности			  = тмпСумма;
					//	ОбластьСтрока.Параметры.РасчетПениНач = (Формат(Период.ДатаНачала, "ДЛФ=Д"));
					//	ОбластьСтрока.Параметры.РасчетПениКон = (Формат(Период.ДатаОкончания, "ДЛФ=Д"));
					//	ОбластьСтрока.Параметры.Дней = ((НачалоДня((Период.ДатаОкончания)) - НачалоДня(Период.ДатаНачала))/(60 * 60 * 24)  + 1 );
					//	ОбластьСтрока.Параметры.Сумма			  = Окр(тмпСумма * КалендарныхДней * (ВыборкаУслуг.ПроцентПени/100),2);	
					//	ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					//	ОбластьСтрока.Параметры.ПериодНачисленияПени =  ПериодДолга;
					//	ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					//	//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					//	ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
					//	Таблица.Вывести(ОбластьСтрока);	
					//КонецЕсли;
					
					
					// Списываем с суммы переплаты уже начисленный долг.
					Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
						Остаток = Остаток - тмпСумма;
						кэшУслуга = ВыборкаУслуг.Услуга;
					КонецЕсли;
					
				Иначе
					
					Если СсылкаОС <> Неопределено Тогда
						// Ограничение долга остаткими по оплате.
						Если Долг > СсылкаОСОплатаУслуги Тогда
							Долг           = СсылкаОСОплатаУслуги;
						КонецЕсли;
						
						// Списываем с суммы оплаты уже начисленный долг.
						Если кэшУслуга <> ВыборкаУслуг.Услуга Тогда
							НСтрОстатокСуммы			 = ТабОстатокСуммы.Добавить();
							НСтрОстатокСуммы.ЛицевойСчет = ВыборкаУслуг.ЛС;
							НСтрОстатокСуммы.Услуга		 = ВыборкаУслуг.Услуга;
							НСтрОстатокСуммы.Сумма		 = -Долг;
							ТабОстатокСуммы.Свернуть("ЛицевойСчет, Услуга", "Сумма");
							кэшУслуга = ВыборкаУслуг.Услуга;
						КонецЕсли;
					КонецЕсли;
					
					КапРемонт = Перечисления.бит_ГрафыОтчетаПоГЦЖС.КапитальныйРемонт;
					НовыяСтрока = Таблица.Добавить();
					НовыяСтрока.ЛицевойСчет		  = кэшЛицевойСчет;
					
					//Если НЕ ЗначениеЗаполнено (КоличествоДнейИтог)  Тогда
					//	Продолжить;
					//ИначеЕсли НЕ МассивДолг.Количество() = 0 Тогда 
					//	СуммаДолга= 0;
					//	Для Индекс = 0 По МассивДолг.Количество() - 1 Цикл
					//		СуммаДолга = СуммаДолга + Окр(МассивДолгСумма[Индекс] * МассивДней[Индекс] * (ВыборкаУслуг.ПроцентПени/100),2); 
					//		ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					//	КонецЦикла;
					//	ОбластьСтрока.Параметры.Сумма			  = Окр(Долг * МассивДней[(МассивДней.Количество() - 1)] * (ВыборкаУслуг.ПроцентПени/100),2) + СуммаДолга ;	
					//Иначе 
					//	ОбластьСтрока.Параметры.Сумма			  = Окр(Долг * КалендарныхДней * (ВыборкаУслуг.ПроцентПени/100),2);	
					//	ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = КоличествоДнейИтог;
					//КонецЕсли;
					
					//ОбластьСтрока.Параметры.ПериодНачисленияПени =  ПериодДолга;
					ОбластьСтрока.Параметры.Услуга			  = ВыборкаУслуг.Услуга;
					ОбластьСтрока.Параметры.СуммаЗадолженности			  = Долг;
					//ОбластьСтрока.Параметры.КоличествоДнейПросрочки	  = ВыборкаУслуг.КоличествоДней;
					//НовыяСтрока.КоличествоМесяцев = ВыборкаУслуг.КоличествоМесяцев; //Для правльного подсчета долга и суммы при свертке (техническая колонка).
					ОбластьСтрока.Параметры.Коэффициент		  = ВыборкаУслуг.ПроцентПени;
					//ОбластьСтрока.Параметры.ПериодНачисленияПени = ВыборкаУслуг.ПериодНачисленияПени;
					ИтогоСумма = ИтогоСумма + ОбластьСтрока.Параметры.Сумма;
					Таблица.Вывести(ОбластьСтрока);	
					
					
				КонецЕсли;
				
			КонецЦикла; // ВыборкаУслуг.
		КонецЦикла; // ВыборкаКоличествоМесяцев.
		
		
		
	КонецЦикла; // ВыборкаЛС.
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.ИтогоСумма = ИтогоСумма;
	Таблица.Вывести(ОбластьПодвал);
	Возврат Таблица   ;
	
КонецФункции

&НаСервере
Функция ПолучитьТаблицуДолга(СсылкаОС, Момент, ДокПени, Организация)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст =
	
	"ВЫБРАТЬ
	|	бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей КАК ПоследнийДеньПриемаПлатежей
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних КАК бит_НастройкаПараметровЖКХСрезПоследних
	|ГДЕ
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация = &Организация";
	
	СрокОплаты = Запрос.Выполнить().Выгрузить();
	СрокОплаты = -СрокОплаты[0].ПоследнийДеньПриемаПлатежей;
	
	Массив = Новый Массив;
	Для каждого Строка Из ДокПени  Цикл
		Массив.Добавить(Строка.ЛС);
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата",		 Период.ДатаОкончания);
	Запрос.Текст =
	
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления.КоличествоМесяцев, 0) КАК КоличествоМесяцев
	|ИЗ
	|	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Начислять = ИСТИНА
	|				И Процент >= 0) КАК бит_ПениПоУслугамЖКХСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоМесяцев УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоИнтервалов = Выборка.Количество(); 
	Если КоличествоИнтервалов = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Необходимо настроить периоды начисления пени в регистре сведений Пени по услугам ЖКХ.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"       , Момент);
	Запрос.УстановитьПараметр("ДатаНачала" , Момент);
	Запрос.УстановитьПараметр("ДатаКонца"  , ?(СсылкаОС<> Неопределено,Новый МоментВремени(Период.ДатаОкончания, СсылкаОС),КонецДня(Период.ДатаОкончания)));
	
	//Лицевойсчет2 = Справочники.бит_ЛицевыеСчета.найтипоНаименованию("76093009990");
	
	Запрос.УстановитьПараметр("ЛицевойСчет", Массив);
	Запрос.УстановитьПараметр("Ссылка"     , СсылкаОС);
	//Запрос.УстановитьПараметр("ТекущаяДата", Дата("20200830"));
	Запрос.УстановитьПараметр("ТекущаяДата", (Период.ДатаОкончания));
	Запрос.УстановитьПараметр("СрокОплаты", СрокОплаты);
	ТекстОстатки = "";
	ТекстОбороты = "";
	ПервыйЭлемент = Истина;
	ПредыдущийЭлемент = 0;
	ПоследнийМесяц = 1;
	
	Пока Выборка.Следующий() Цикл
		
		КоличествоИнтервалов = КоличествоИнтервалов - 1;
		
		//Остатки.
		Если НЕ ПервыйЭлемент Тогда
			ТекстОстатки = ТекстОстатки + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли; 
		
		ТекстОстатки = ТекстОстатки + "
		|ВЫБРАТЬ
		|	" + ?(ПервыйЭлемент, 999, ПредыдущийЭлемент) + " КАК КоличествоМесяцев,
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток) КАК СуммаОстаток";
		
		Если ПервыйЭлемент Тогда
			ТекстОстатки = ТекстОстатки + "
			|ПОМЕСТИТЬ ВТ_Остатки ";
		КонецЕсли; 
		
		ТекстОстатки = ТекстОстатки + "
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ДатаНачала, ДЕНЬ, &СрокОплаты), МЕСЯЦ, -" + Выборка.КоличествоМесяцев + "), ЛицевойСчет В (&ЛицевойСчет)) КАК НачисленияПоУслугамЖКХПоПериодуОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет,
		|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ";
		
		
		//Обороты.
		Если ПервыйЭлемент Тогда
			ТекстОбороты = ТекстОбороты + 
			";
			|
			|////////////////////////////////////////////////////////////////////////////////";
		Иначе
			ТекстОбороты = ТекстОбороты + " ОБЪЕДИНИТЬ ВСЕ ";
		КонецЕсли; 
		
		ТекстОбороты = ТекстОбороты + "
		|ВЫБРАТЬ
		|	" + ?(ПервыйЭлемент, 999, ПредыдущийЭлемент) + " КАК КоличествоМесяцев,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
		|					И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор <> &Ссылка
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаОборот * -1
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Оплата,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет КАК ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(ВЫБОР
		|			КОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
		|					И бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Регистратор <> &Ссылка
		|				ТОГДА бит_НачисленияПоУслугамЖКХПоПериодуОбороты.СуммаРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Разовые,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период КАК Период,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов";
		
		Если ПервыйЭлемент Тогда
			ТекстОбороты = ТекстОбороты + "
			|ПОМЕСТИТЬ ТаблицаОплаты ";
		КонецЕсли; 
		
		ТекстОбороты = ТекстОбороты + "
		|ИЗ
		|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Обороты(ДОБАВИТЬКДАТЕ(&ДатаНачала, МЕСЯЦ, -" + Выборка.КоличествоМесяцев + "), &ДатаКонца, Регистратор, ЛицевойСчет в (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ЛицевойСчет,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.УслугаЖКХ,
		|   бит_НачисленияПоУслугамЖКХПоПериодуОбороты.Период,
		|	бит_НачисленияПоУслугамЖКХПоПериодуОбороты.ПериодВзаиморасчетов";
		
		
		ПервыйЭлемент = Ложь;
		ПредыдущийЭлемент = Выборка.КоличествоМесяцев;
		
	КонецЦикла; 
	
	// Итоговый текст запроса. Смещаем всю сумму переплат в самый поздний период,
	// где наибольшей процент пени, чтобы уменьшить долг.
	
	
	Запрос.Текст = ТекстОстатки + ТекстОбороты +
	";
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиМесяц
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХПоПериодуОстатки
	|ГДЕ
	|	бит_НачисленияПоУслугамЖКХПоПериодуОстатки.ПериодВзаиморасчетов МЕЖДУ ДОБАВИТЬКДАТЕ(&ДатаКонца, МЕСЯЦ, -3) И &ДатаКонца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Оплата,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаРасход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Разовые,
	|	СУММА(ВЫБОР
	|			КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|					И бит_НачисленияПоУслугамЖКХОбороты.Регистратор <> &Ссылка
	|				ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаПриход
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК РазовыеПриход
	|ПОМЕСТИТЬ ВТ_ТекОплаты
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&ДатаНачала, &ДатаКонца, Регистратор, ЛицевойСчет В (&ЛицевойСчет)) КАК бит_НачисленияПоУслугамЖКХОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет,
	|	бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ КАК УслугаЖКХ,
	|	СУММА(НачисленияПоУслугамЖКХПоПериодуОстатки.СуммаОстаток) КАК СуммаОстаток
	|ПОМЕСТИТЬ ВТ_ТекОстаток
	|ИЗ
	|	РегистрНакопления.бит_НачисленияПоУслугамЖКХПоПериоду.Остатки(&ДатаНачала, ЛицевойСчет В (&ЛицевойСчет)) КАК НачисленияПоУслугамЖКХПоПериодуОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.ЛицевойСчет,
	|	НачисленияПоУслугамЖКХПоПериодуОстатки.УслугаЖКХ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТекОстаток.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_ТекОстаток.УслугаЖКХ КАК УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0) < 0
	|			ТОГДА (ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0)) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Переплата
	|ПОМЕСТИТЬ ВР_ВсеПереплаты
	|ИЗ
	|	ВТ_ТекОстаток КАК ВТ_ТекОстаток
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТекОплаты КАК ВТ_ТекОплаты
	|		ПО ВТ_ТекОстаток.ЛицевойСчет = ВТ_ТекОплаты.ЛицевойСчет
	|			И ВТ_ТекОстаток.УслугаЖКХ = ВТ_ТекОплаты.УслугаЖКХ
	|ГДЕ
	|	НЕ ВТ_ТекОстаток.ЛицевойСчет ЕСТЬ NULL
	|	И НЕ ВТ_ТекОстаток.УслугаЖКХ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ТекОстаток.ЛицевойСчет,
	|	ВТ_ТекОстаток.УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0) < 0
	|			ТОГДА (ЕСТЬNULL(ВТ_ТекОстаток.СуммаОстаток, 0) - ЕСТЬNULL(ВТ_ТекОплаты.Оплата, 0) + ЕСТЬNULL(ВТ_ТекОплаты.РазовыеПриход, 0)) * -1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Остатки.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_Остатки.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Остатки.УслугаЖКХ КАК Услуга,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0)
	|	КОНЕЦ КАК Долг,
	|	ВР_ВсеПереплаты.Переплата КАК Переплата,
	|	ТаблицаОплаты.Период КАК Период,
	|	ТаблицаОплаты.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВТ_Остатки.СуммаОстаток КАК СуммаОстаток,
	|	ТаблицаОплаты.Оплата КАК Оплата,
	|	ВТ_ОстаткиМесяц.СуммаОстаток КАК СуммаОстаток1
	|ПОМЕСТИТЬ ВР_Таб
	|ИЗ
	|	ВТ_Остатки КАК ВТ_Остатки
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТаблицаОплаты КАК ТаблицаОплаты
	|			ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОстаткиМесяц КАК ВТ_ОстаткиМесяц
	|			ПО (ВТ_ОстаткиМесяц.УслугаЖКХ = ТаблицаОплаты.УслугаЖКХ)
	|				И (ВТ_ОстаткиМесяц.ЛицевойСчет = ТаблицаОплаты.ЛицевойСчет)
	|		ПО ВТ_Остатки.КоличествоМесяцев = ТаблицаОплаты.КоличествоМесяцев
	|			И ВТ_Остатки.ЛицевойСчет = ТаблицаОплаты.ЛицевойСчет
	|			И ВТ_Остатки.УслугаЖКХ = ТаблицаОплаты.УслугаЖКХ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ВсеПереплаты КАК ВР_ВсеПереплаты
	|		ПО ВТ_Остатки.ЛицевойСчет = ВР_ВсеПереплаты.ЛицевойСчет
	|			И ВТ_Остатки.УслугаЖКХ = ВР_ВсеПереплаты.УслугаЖКХ
	|ГДЕ
	|	НЕ ВТ_Остатки.КоличествоМесяцев ЕСТЬ NULL
	|	И НЕ ВТ_Остатки.ЛицевойСчет ЕСТЬ NULL
	|	И НЕ ВТ_Остатки.УслугаЖКХ ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Остатки.КоличествоМесяцев,
	|	ВТ_Остатки.ЛицевойСчет,
	|	ВТ_Остатки.УслугаЖКХ,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(ВТ_Остатки.СуммаОстаток, 0) - ЕСТЬNULL(ТаблицаОплаты.Оплата, 0) - ЕСТЬNULL(ТаблицаОплаты.Разовые, 0)
	|	КОНЕЦ,
	|	ВР_ВсеПереплаты.Переплата,
	|	ТаблицаОплаты.Период,
	|	ТаблицаОплаты.ПериодВзаиморасчетов,
	|	ВТ_Остатки.СуммаОстаток,
	|	ТаблицаОплаты.Оплата,
	|	ВТ_ОстаткиМесяц.СуммаОстаток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВР_Таб.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВР_Таб.ЛицевойСчет КАК ЛицевойСчет,
	|	ВР_Таб.Услуга КАК Услуга,
	|	МИНИМУМ(ВЫБОР
	|			КОГДА ВР_Таб1.Долг ЕСТЬ NULL
	|				ТОГДА ВР_Таб.Долг
	|			ИНАЧЕ ВР_Таб1.Долг - ВР_Таб.Оплата
	|		КОНЕЦ) КАК Долг,
	|	МИНИМУМ(ВР_Таб1.Долг) КАК Долг1,
	|	ВР_Таб.Переплата КАК Переплата,
	|	ВР_Таб.Период КАК Период,
	|	ВР_Таб.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВР_Таб.СуммаОстаток КАК СуммаОстаток,
	|	ВР_Таб.Оплата КАК Оплата,
	|	ВР_Таб.СуммаОстаток1 КАК СуммаОстаток1
	|ПОМЕСТИТЬ ВР_Таб12
	|ИЗ
	|	ВР_Таб КАК ВР_Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб1
	|		ПО ВР_Таб.ЛицевойСчет = ВР_Таб1.ЛицевойСчет
	|			И ВР_Таб.Услуга = ВР_Таб1.Услуга
	|			И ВР_Таб.КоличествоМесяцев = ВР_Таб1.КоличествоМесяцев
	|			И ВР_Таб.ПериодВзаиморасчетов > ВР_Таб1.ПериодВзаиморасчетов
	|ГДЕ
	|	НЕ ВР_Таб.Период = ВР_Таб.ПериодВзаиморасчетов
	|
	|СГРУППИРОВАТЬ ПО
	|	ВР_Таб.ПериодВзаиморасчетов,
	|	ВР_Таб.КоличествоМесяцев,
	|	ВР_Таб.ЛицевойСчет,
	|	ВР_Таб.Услуга,
	|	ВР_Таб.Переплата,
	|	ВР_Таб.СуммаОстаток,
	|	ВР_Таб.Оплата,
	|	ВР_Таб.Период,
	|	ВР_Таб.СуммаОстаток1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ДельтаТаблица.КоличествоМесяцев) КАК ДельтаТаблицаКоличествоМесяцев,
	|	ВР_Таб12.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВР_Таб12.ЛицевойСчет КАК ЛицевойСчет,
	|	ВР_Таб12.Услуга КАК Услуга,
	|	ВР_Таб12.Долг КАК Долг,
	|	ВР_Таб12.Период КАК Период,
	|	ВР_Таб12.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВР_Таб12.Переплата КАК Переплата,
	|	ВР_Таб12.СуммаОстаток1 КАК СуммаОстаток1
	|ПОМЕСТИТЬ ИтоговаяТаблица
	|ИЗ
	|	ВР_Таб12 КАК ВР_Таб12
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ДельтаТаблица
	|		ПО ВР_Таб12.ЛицевойСчет = ДельтаТаблица.ЛицевойСчет
	|			И ВР_Таб12.Услуга = ДельтаТаблица.Услуга
	|			И ВР_Таб12.КоличествоМесяцев < ДельтаТаблица.КоличествоМесяцев
	|
	|СГРУППИРОВАТЬ ПО
	|	ВР_Таб12.КоличествоМесяцев,
	|	ВР_Таб12.ЛицевойСчет,
	|	ВР_Таб12.Услуга,
	|	ВР_Таб12.Долг,
	|	ВР_Таб12.Период,
	|	ВР_Таб12.ПериодВзаиморасчетов,
	|	ВР_Таб12.Переплата,
	|	ВР_Таб12.СуммаОстаток1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИтоговаяТаблица.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ИтоговаяТаблица.ЛицевойСчет КАК ЛицевойСчет,
	|	ИтоговаяТаблица.Услуга КАК Услуга,
	|	ИтоговаяТаблица.Долг КАК Долг,
	|	ИтоговаяТаблица.Долг - ЕСТЬNULL(ВР_Таб.Долг, 0) КАК ДолгДляНачисления,
	|	ИтоговаяТаблица.Период КАК Период,
	|	ИтоговаяТаблица.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ИтоговаяТаблица.Переплата КАК Переплата,
	|	ИтоговаяТаблица.СуммаОстаток1 КАК СуммаОстаток1
	|ПОМЕСТИТЬ ВТ_Итоговая
	|ИЗ
	|	ИтоговаяТаблица КАК ИтоговаяТаблица
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВР_Таб КАК ВР_Таб
	|		ПО ИтоговаяТаблица.ДельтаТаблицаКоличествоМесяцев = ВР_Таб.КоличествоМесяцев
	|			И ИтоговаяТаблица.ЛицевойСчет = ВР_Таб.ЛицевойСчет
	|			И (ВР_Таб.Услуга = ИтоговаяТаблица.Услуга)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Итоговая.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ВТ_Итоговая.ЛицевойСчет КАК ЛицевойСчет,
	|	ВТ_Итоговая.Услуга КАК Услуга,
	|	ВТ_Итоговая.Долг КАК Долг,
	|	ВТ_Итоговая.ДолгДляНачисления КАК ДолгДляНачисления,
	|	РАЗНОСТЬДАТ(ВТ_Итоговая.Период, &ТекущаяДата, ДЕНЬ) КАК Период,
	|	ВТ_Итоговая.ПериодВзаиморасчетов КАК ПериодВзаиморасчетов,
	|	ВТ_Итоговая.Переплата КАК Переплата,
	|	ВТ_Итоговая.СуммаОстаток1 КАК СуммаОстаток1,
	|	ВТ_Итоговая.Период КАК Период1
	|ИЗ
	|	ВТ_Итоговая КАК ВТ_Итоговая
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Итоговая.КоличествоМесяцев,
	|	Период УБЫВ"; 
	
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
